# -*- coding: utf-8 -*-
# Генератор паролів

# Придумує вам складний пароль

# Бібліотека для генерації випадкового символа
import random

# Список символів
letters = ("A", "a", "B", "b", "C", "c", "D", "d", "E", "e", "F", "f", "G", "g", "H", "h", "I", "i", "J", "j", "K", "k", "L", "l", "M", "m", "N", "n", "O", "o", "P", "p", "Q", "q", "R", "r", "S", "s", "T", "t", "U", "u", "W", "w", "X", "x", "Y", "y", "Z", "z", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "!", "@", "#", "$", "%", "^", "&", "(", ")", "-", "_", "=", "+", "|", "<", ".", ">", "`")

# Вступне слово
print("\tДоброго Дня! \n\tВас вітає Генератор Паролів. \n\tНадійний пароль повинен бути не менш як 8 символів\n")

def genpass():
	"""Генерує пароль"""
	password = "" # Пароль поки пустий
	lenght = int(input("Скільки символів буде у вашоиму паролі?\n"))
	"""Поки пароль не буде вказаної довжини, беремо по символу і додаємо до пустого паролю. Символ додається, якщо його ще нема у паролі, тобото однакових символів не повинно бути"""
	while len(password) <= (lenght - 1):
		symbol = random.choice(letters)
		if symbol not in password:
			password += symbol
	print("Ваш пароль: \n", password)
	return password

def main():
	"""Основна функція"""
	genpass() 
	next = None # Поки не знаємо, будуть ще генеруватись паролі чи ні
	while next != "N":
		next = input("\nЗгенерувати ще один пароль?\n Введіть Y якщо так чи N для виходу\n")
		if next.upper() == "Y":
			genpass()
		elif next.upper() == "N":
			print("\nДякую!")
		else:
			print("Введіть y якщо так чи n для виходу\n")

main()

input("\nНатисніть Ентер для виходу")

